export type Category =
  | '럼'
  | '와인'
  | '리큐르'
  | '위스키'
  | '사케'
  | '기타'
  | '전통주'
  | '맥주'
  | '브랜디';

export type SubCategory =
  | '럼'
  | '주정강화'
  | '과일'
  | '싱글몰트'
  | '레드'
  | '화이트'
  | '아메리칸(버번)'
  | '다이긴죠'
  | '블렌디드'
  | '내추럴'
  | '로제'
  | '진'
  | '발효주'
  | '약주'
  | '스파클링'
  | '보드카'
  | '증류주'
  | '블렌디드 몰트'
  | '라이'
  | '기타'
  | '에일'
  | '꼬냑'
  | '준마이'
  | '청주'
  | '라거'
  | '백주(고량주)'
  | '준마이 다이긴죠'
  | '준마이 긴죠'
  | '깔바도스'
  | '재패니즈'
  | '사이더'
  | '디저트'
  | '에'
  | '데킬라'
  | '필스너'
  | '위스키베이스'
  | '아이리시'
  | '사워'
  | '허브'
  | '아르마냑'
  | '일본식 소주'
  | '커피'
  | '시음권'
  | '뉴월드'
  | '아페리티보'
  | '버무스'
  | '캐나디안'
  | '독립 병입'
  | '메즈칼'
  | '논알콜'
  | '라'
  | '오렌지'
  | '긴죠'
  | '발포주'
  | '블랜디드'
  | '상그리아';

export const categories: Category[] = [
  '맥주',
  '와인',
  '위스키',
  '브랜디',
  '리큐르',
  '럼',
  '전통주',
  '사케',
  '기타',
];

export const subCategories: SubCategory[] = [
  '럼',
  '주정강화',
  '과일',
  '싱글몰트',
  '레드',
  '화이트',
  '아메리칸(버번)',
  '다이긴죠',
  '블렌디드',
  '내추럴',
  '로제',
  '진',
  '발효주',
  '약주',
  '스파클링',
  '보드카',
  '증류주',
  '블렌디드 몰트',
  '라이',
  '기타',
  '에일',
  '꼬냑',
  '준마이',
  '청주',
  '라거',
  '백주(고량주)',
  '준마이 다이긴죠',
  '준마이 긴죠',
  '깔바도스',
  '재패니즈',
  '사이더',
  '디저트',
  '에',
  '데킬라',
  '필스너',
  '위스키베이스',
  '아이리시',
  '사워',
  '허브',
  '아르마냑',
  '일본식 소주',
  '커피',
  '시음권',
  '뉴월드',
  '아페리티보',
  '버무스',
  '캐나디안',
  '독립 병입',
  '메즈칼',
  '논알콜',
  '라',
  '오렌지',
  '긴죠',
  '발포주',
  '블랜디드',
  '상그리아',
];
